#include "bsp_beep.h"
#include "delay.h"

 int melody[] = {247,262,294,330,349,392,440,294,523,587,659,698,784,1000};
 
void BEEP_Init(void)
{ 
 GPIO_InitTypeDef  GPIO_InitStructure; 
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);   
 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;  
 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
 GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
 GPIO_Init(GPIOB, &GPIO_InitStructure);
 //GPIO_ResetBits(GPIOB,GPIO_Pin_1);
    
 GPIO_SetBits(GPIOB,GPIO_Pin_1);
}

void Sound(u16 frq)
{
    u32 time;
    if(frq != 1000)
    {
        time = 500000/((u32)frq);
        BEEP = 1;
        delay_us(time);
        BEEP = 0;
        delay_us(time);
    }else
        delay_us(1000);
}
void Sound2(u16 time)
{
    BEEP = 1;
    delay_ms(time);
    BEEP = 0;
    delay_ms(time);
}

void play_successful(void)
{
    int id=0;
    for(id = 0 ;id < 12 ;id++)
    {
        Sound2(melody[id]);
    }
}
void play_failed(void)
{
    int id=0;
    for(id = 11 ;id >=0 ;id--)
    {
        Sound2(melody[id]);
    }
}

void play_music(void)
{    
//起床歌
    /*uc16 tone[] = {247,262,294,330,349,392,440,294,523,587,659,698,784,1000};    
    u8 music[]={5,5,6,8,7,6,5,6,13,13,5,5,6,8,7,6,5,3,13,13,2,2,3,5,3,5,6,3,2,1,6,6,5,6,5,3,6,5,13,13,
                  5,5,6,8,7,6,5,6,13,13,5,5,6,8,7,6,5,3,13,13,2,2,3,5,3,5,6,3,2,1,6,6,5,6,5,3,6,1,    
              13,8,9,10,10,9,8,10,9,8,6,13,6,8,9,9,8,6,9,8,6,5,13,2,3,5,5,3,5,5,6,8,7,6,6,10,9,9,8,6,5,6,8  };            
    u8 time[] = {2,4,2,2,2,2,2,8,4, 4,2,4,2,2,2,2,2,8,4, 4, 2,4,2,4,2,2,4,2,2,8,2,4,2,2,2,2,2,8,4 ,4, 
                2,4,2,2,2,2,2,8,4, 4,2,4,2,2,2,2,2,8,4,4,2,4,2,4,2,2,4,2,2,8,2,4,2,2,2,2,2,8,
                4,2,2,2,4,2,2,2,2,2,8,4,2,2,2,4,2,2,2,2,2,8,4,2,2,2,4,2,2,5,2,6,2,4,2,2,2,4,2,4,2,2,12  };*/
 
/*************************************************************************************************************************/
   //音谱         低1  2   3   4   5   6   7  中1  2   3   4   5   6   7  高1    2   3     4    5    6    7  不发音
        uc16 tone[] = {262,294,330,349,392,440,494,523,587,659,698,784,880,988,1047,1175,1319,1397,1568,1760,1967,1000};//音频数据表
        //编号          0   1   2   3   4   5   6   7   8   9   10  11  12  13  14   15   16    17   18   19   20  21
        
        //音谱
        u8 music[]={8,8,9,8,  8,9,81, 7,5,6,3,  3,4,55,  6,3,55,6,  3,6,6,22,  3,5,6,10,  5,2,55,};
        //节拍
        u8 time[] = {5,5,4,6,        //时间--2代表半拍(100ms) 4代表一拍(200ms) 8代表两拍(400ms)
                      5,6,3, 4,5,3,7,  2,3,3,  1,6,3,7,  4,8,6,8, 7,3,5,6, 8,5,6,};    
        u32 delayShow;
        u16 i,j;
        delayShow = 10;//控制播放快慢
        for(i=0;i<sizeof(music)/sizeof(music[0]);i++)//放歌
        {
                for(j=0;j<((u16)time[i])*tone[music[i]]/delayShow;j++)
                {
                        Sound((u32)tone[music[i]]);
                }        
        }
}

//神秘曲，我也不知道什么歌
void play_music2(void)
{
        //             低1  2   3   4   5   6   7  中1  2   3   4   5   6   7  高1    2   3     4    5    6    7  不发音
        uc16 tone[] = {247,262,294,330,349,392,440,294,523,587,659,698,784,1000};//音频数据表
        //              0   1   2   3   4   5   6   7   8   9   10  11  12  13  14   15   16    17   18   19   20  21
//        //音调
       u8 music[]={
                2,1,2,1,5,6,5,6,5,6,
							  5,7,7,6,5,5,5,5,3,3,
								5,5,3,2,4,3,2,1,2,1,


								1,0,2,2,3,5,6,6,6,5,
								3,6,5,8,7,6,5,3,13,13,
							  2,2,3,5,3,5,6,3,2,1,
								6,6,5,6,5,3,6,1,	

								13,8,9,10,10,9,8,10,9,8,6,
								13,6,8,9,9,8,6,9,8,6,5,
								13,2,3,5,5,3,5,5,6,8,7,6,
								6,10,9,9,8,6,5,6,8                    };        
         //节拍
         u8 time[] = {2,1,2,1,5,6,5,6,5,6,
							  5,7,7,6,5,5,5,5,3,3,
								5,5,3,2,4,3,2,1,2,1,
 
	
								2,4,2,2,2,2,2,8,4, 4, 
								2,4,2,2,2,2,2,8,4, 4, 
								2,4,2,4,2,2,4,2,2,8,
								2,4,2,2,2,2,2,8,
	
								4, 2,2,2, 4, 2,2,2, 2,2,8,
								4, 2,2,2,4,2,2,2,2,2,8,
								4, 2,2,2,4,2,2,5,2,6,2,4,
								2,2 ,2,4,2,4,2,2,12                    
                };        
         u32 delayShow;
         u16 i,j;
         delayShow = 5;//播放速度
         for(i=0;i<sizeof(music)/sizeof(music[0]);i++)//放歌
         {
                 for(j=0;j<((u16)time[i])*tone[music[i]]/delayShow;j++)
                 {
                         Sound((u32)tone[music[i]]);
                 }        
         }
}  


